{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "batch_input_shape": [null, 3, 224, 224], "trainable": false, "name": "zeropadding2d_14", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1_1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_15"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1_2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_6", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_16"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2_1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_17"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2_2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_18"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3_1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_19"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3_2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_20"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3_3", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_21"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_22"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_23"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_3", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_9", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": false, "name": "zeropadding2d_24"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv5_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_25"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv5_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_26"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv5_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 512, 7, 7], "trainable": true, "name": "flatten_2", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}]}]}